//
//  MarketDataModel.swift
//  CryptoTracker
//
//  Created by Микита Кузьмінов on 02.01.2024.
//

import Foundation

// CoinGecko API Info
/*
 URL: https://api.coingecko.com/api/v3/global
 
 Response:
 {
   "data": {
     "active_cryptocurrencies": 11905,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 960,
     "total_market_cap": {
       "btc": 40318200.42652771,
       "eth": 762663836.4247096,
       "ltc": 24456353904.709995,
       "bch": 6903310116.987805,
       "bnb": 5766460871.739855,
       "eos": 2074912360032.8706,
       "xrp": 2889124432361.065,
       "xlm": 13891318121993.893,
       "link": 115495582357.6083,
       "dot": 210178880382.55017,
       "yfi": 219830161.86566672,
       "usd": 1842971214338.7236,
       "aed": 6768680378901.82,
       "ars": 1489987695117597,
       "aud": 2701676007091.6377,
       "bdt": 202826134709259.4,
       "bhd": 694687726561.6238,
       "bmd": 1842971214338.7236,
       "brl": 8944676491671.584,
       "cad": 2442604014578.4023,
       "chf": 1559750770004.0068,
       "clp": 1616641415245946.2,
       "cny": 13152364071128.326,
       "czk": 41282923795430.17,
       "dkk": 12474001383583.305,
       "eur": 1673134045052.5557,
       "gbp": 1449168811201.255,
       "gel": 4948377710499.489,
       "hkd": 14402228446297.326,
       "huf": 639429975931241.5,
       "idr": 28506806073957260,
       "ils": 6655332120306.351,
       "inr": 153555569101080.4,
       "jpy": 260885706559548.84,
       "krw": 2414698732283456,
       "kwd": 566319252569.2892,
       "lkr": 598600874582486.1,
       "mmk": 3881172575072660.5,
       "mxn": 31202689532216.66,
       "myr": 8482275013993.981,
       "ngn": 1657015418811948.5,
       "nok": 18761483821392.504,
       "nzd": 2920344541672.9253,
       "php": 102583001146747.28,
       "pkr": 514153827025389,
       "pln": 7266763622260.227,
       "rub": 166784726096767.6,
       "sar": 6911770506954.315,
       "sek": 18581259666342.312,
       "sgd": 2438011330312.2695,
       "thb": 62921801714345.72,
       "try": 54723159970238.414,
       "twd": 56895287686429.23,
       "uah": 70270669704204.71,
       "vef": 184536707691.73657,
       "vnd": 44846610533625760,
       "zar": 33752795900698.617,
       "xdr": 1377034917872.0383,
       "xag": 76557613994.41928,
       "xau": 887095764.309803,
       "bits": 40318200426527.71,
       "sats": 4031820042652771
     },
     "total_volume": {
       "btc": 1893827.461856858,
       "eth": 35823863.72175224,
       "ltc": 1148764432.728895,
       "bch": 324262445.71828276,
       "bnb": 270862336.14332193,
       "eos": 97462832338.89102,
       "xrp": 135708021013.9282,
       "xlm": 652503322631.2465,
       "link": 5425061219.946578,
       "dot": 9872527329.094423,
       "yfi": 10325867.550668662,
       "usd": 86568087370.03806,
       "aed": 317938614483.93835,
       "ars": 69987737175538.58,
       "aud": 126903189158.7968,
       "bdt": 9527153985819.773,
       "bhd": 32630888285.174763,
       "bmd": 86568087370.03806,
       "brl": 420149555241.74384,
       "cad": 114734053412.92851,
       "chf": 73264649975.36014,
       "clp": 75936918706160.23,
       "cny": 617793155516.2778,
       "czk": 1939142470706.3218,
       "dkk": 585929087349.0264,
       "eur": 78590491846.5397,
       "gbp": 68070391596.98312,
       "gel": 232435314588.55298,
       "hkd": 676501814440.8019,
       "huf": 30035319918601.492,
       "idr": 1339022367604655,
       "ils": 312614417406.4191,
       "inr": 7212815815394.007,
       "jpy": 12254329564851.416,
       "krw": 113423285834466.23,
       "kwd": 26601161295.589523,
       "lkr": 28117494406569.605,
       "mmk": 182306529783559.7,
       "mxn": 1465653469023.0125,
       "myr": 398429622120.60046,
       "ngn": 77833367354401.33,
       "nok": 881264860788.7354,
       "nzd": 137174492725.25172,
       "php": 4818531150601.131,
       "pkr": 24150845695950.652,
       "pln": 341334592344.6526,
       "rub": 7834216089974.811,
       "sar": 324659847355.43646,
       "sek": 872799367524.819,
       "sgd": 114518325739.20236,
       "thb": 2955564354944.163,
       "try": 2570457561469.809,
       "twd": 2672486795812.222,
       "uah": 3300755555581.15,
       "vef": 8668062588.36192,
       "vnd": 2106536048268115,
       "zar": 1585437125540.3208,
       "xdr": 64682116657.319885,
       "xag": 3596066051.139345,
       "xau": 41668683.17469421,
       "bits": 1893827461856.8582,
       "sats": 189382746185685.8
     },
     "market_cap_percentage": {
       "btc": 48.58212119012542,
       "eth": 15.75929274207773,
       "usdt": 4.977484657963555,
       "sol": 2.711878536127559,
       "bnb": 2.6682998039916503,
       "xrp": 1.8640812213191305,
       "usdc": 1.3408922935580505,
       "steth": 1.2067513968228694,
       "ada": 1.2015766354947885,
       "avax": 0.8590543477109951
     },
     "market_cap_change_percentage_24h_usd": 6.103970001774576,
     "updated_at": 1704189785
   }
 }
 */

struct GlobalMarketData: Codable {
    let data: MarketDataModel
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd" }) {
            return item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd" }) {
            return item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc" }) {
            return item.value.asPercentString()
        }
        return ""
    }
}
